Revit 2026 API

# IExternalService Interface

---

The base interface class for all external services.

**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IExternalService
```
```vb
Public Interface IExternalService
```
```cpp
public interface class IExternalService
```
```fsharp
type IExternalService = interface end
```

The IExternalService type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Execute | Implement this method to execute the given server. |
|  | GetDescription | Implement this method to return a description of the service. |
|  | GetName | Implement this method to return the name of the service. |
|  | GetServiceId | Implement this method to return the unique Id of the service. |
|  | GetVendorId | Implement this method to return the vendor Id of the service. |
|  | IsValidServer | Implement this method to check if the given instance represents a valid server of this service. |
|  | OnServersChanged |  |
|  | OnServersDisparity |  |

Both supported kinds of services - single-server and multi-server - will derive their classes from this interface, albeit indirectly through an interface specific to the particular kind. External services never derive directly from this class - they always have to derive from either ISingleServerService or IMultiServerService, respectivelly.

#### Reference

Autodesk.Revit.DB.ExternalService Namespace